-- Тестовые графики работы
INSERT INTO working_hours (id, monday, tuesday, wednesday, thursday, friday, saturday, sunday)
VALUES
  (2001, '09:00-22:00', '09:00-22:00', '09:00-22:00', '09:00-22:00', '09:00-23:00', '10:00-23:00', '10:00-22:00'),
  (2002, '10:00-21:00', '10:00-21:00', '10:00-21:00', '10:00-21:00', '10:00-22:00', '11:00-22:00', '11:00-21:00'),
  (2003, '08:00-20:00', '08:00-20:00', '08:00-20:00', '08:00-20:00', '08:00-21:00', '09:00-21:00', '09:00-20:00'),
  (2004, '11:00-23:00', '11:00-23:00', '11:00-23:00', '11:00-23:00', '11:00-00:00', '12:00-00:00', '12:00-23:00')
ON CONFLICT DO NOTHING;

SELECT setval(pg_get_serial_sequence('working_hours', 'id'), (SELECT COALESCE(MAX(id), 0) FROM working_hours));
